Repository: AKotov-dev/PConverter
Catalog: pconverter/languages/pconverter.*.po
Languages: ru

# taboutform.caption
source: About
ru: О программе

source: Try to convert the scripts that are meant to be run when the package is installed and removed. Use this with caution, becuase these scripts might be designed to work on a system unlike your own, and could cause problems. It is recommended that you examine the scripts by hand and check to see what they do before using this option.
ru: Попытаться преобразовать сценарии, которые должны запускаться при установке и удалении пакета. Используйте это с осторожностью, потому что эти сценарии могут быть разработаны для работы в системе, отличной от вашей собственной, и могут вызвать проблемы. Рекомендуется изучить сценарии вручную и проверить, что они делают, прежде чем использовать эту опцию.

source: Be verbose: Display each command alien runs in the process of converting a package.
ru: Подробный лог: Показать каждую команду, выполняемую alien в процессе преобразования пакета.

source: Test the generated packages. Currently this is only supported for debian packages, which, if lintian is installed, will be tested with lintian and lintian's output displayed.
ru: Тест сгенерированных пакетов. В настоящее время это поддерживается только для пакетов debian, которые, будут протестированы с отображением вывода lintian.

source: Specify the patch to be used instead of automatically looking the patch up in /var/lib/alien. This has no effect unless a debian package is being built.
ru: Укажите патч, который будет использоваться вместо автоматического поиска патча в файле /var/lib/alien. Работает только с пакетами debian.

source: Specifiy a description for the package. This only has an effect when converting from the tgz package format, which lacks descriptions.
ru: Укажите описание пакета. Это работает только при преобразовании из формата пакета tgz, в котором отсутствуют описания.

source: Specifiy a version for the package. This only has an effect when converting from the tgz package format, which may lack version information.
ru: Укажите версию пакета. Это работает только при преобразовании из формата пакета tgz, в котором может отсутствовать информация о версии.

source: By default, alien adds one to the minor version number of each package it converts. If this option is given, alien will not do this.
ru: По умолчанию alien добавляет единицу к младшему номеру версии каждого пакета, который он преобразует. Если этот вариант будет задан, alien этого делать не будет.

source: Sanitize all file owners and permissions when building a deb. This may be useful if the original package is a mess. On the other hand, it may break some things to mess with their permissions and owners to the degree this does, so it defaults to off. This can only be used when converting to debian packages.
ru: Очистка всех владельцев и разрешений файлов при создании deb. Это может быть полезно, если оригинальная упаковка находится в беспорядке. С другой стороны, он может сломать некоторые вещи, чтобы возиться с их разрешениями и владельцами в той степени, в какой это происходит, поэтому по умолчанию он выключен. Это можно использовать только при преобразовании в пакеты debian.

source: Do not use any patch files.
ru: Не использовать файлы исправлений.

source: Generate a temporary directory suitable for building a package from, but do not actually create the package. This is useful if you want to move files around in the package before building it. The package can be built from this temporary directory by running "debian/rules binary", if you were creating a Debian package, or by running "rpmbuild -bb <packagename>.spec" if you were creating a Red Hat package.
ru: Создать временный каталог, подходящий для создания пакета, но на самом деле не создавать его. Это полезно, если вы хотите переместить файлы в пакете перед его сборкой. Пакет можно создать из этого временного каталога, запустив "debian/rules binary", если вы создавали пакет Debian, или запустив "rpmbuild-bb <имя пакета>.spec", если вы создавали пакет Red Hat.

source: Like -g, but do not generate the packagename.orig directory. This is only useful when you are very low on disk space and are generating a debian package.
ru: Как-g, но не генерирует каталог packagename.orig. Это полезно только тогда, когда у вас очень мало места на диске и вы создаете пакет debian.

source: Automatically install each generated package, and remove the package file after it has been installed.
ru: Автоматически устанавливает каждый сгенерированный пакет и удаляет файл пакета после его установки.

source: Be less strict about which patch file is used, perhaps attempting to use a patch file for an older verson of the package. This is not guaranteed to always work; older patches may not necessarily work with newer packages.
ru: Быть менее строгим в отношении того, какой файл патча используется, возможно, пытаясь использовать файл патча для более старой версии пакета. Это не гарантирует, что всегда будет работать; старые патчи могут и не работать с новыми пакетами.

source: Instead of incrementing the version number of the converted package by 1, increment it by the given number.
ru: Вместо того чтобы увеличивать номер версии преобразованного пакета на 1, увеличьте его на заданное число.

source: Package Type
ru: Тип Пакета

# tmainform.convertbtn.caption
source: Convert
ru: Конвертировать

# tmainform.label1.caption
source: [ Select your final package type ]
ru: [ Выберите тип конечного пакета ]

# tmainform.label2.caption
source: alien supports conversion between Linux Standard Base (LSB), LSB-compliant .rpm packages, .deb, Stampede (.slp), Solaris (.pkg) and Slackware (.tgz, .txz, .tbz, .tlz) packages. It is also capable of automatically installing the generated packages, and can try to convert the installation scripts included in the archive well.
ru: alien поддерживает преобразование между пакетами Linux Standard Base (LSB), LSB-совместимыми пакетами .rpm, .deb, Stampede (.slp), Solaris (.pkg) и Slackware (.tgz, .txz, .tbz, .tlz). Он также способен автоматически устанавливать сгенерированные пакеты и может попытаться преобразовать сценарии установки, включенные в архив.

source: OPTIONS
ru: ОПЦИИ

# tmainform.label4.caption
source: Idle
ru: Ожидание

source: * File and Folder path should not contain spaces or any Characteristics
ru: * Путь не должен содержать пробелов или других Особенностей

source: Add
ru: Добавить

source: Quit
ru: Выход

source: Folder
ru: Папка

# tmainform.toolbutton9.caption
source: About
ru: О программе

source: [ Generate a Debian package ]
ru: [ Создать пакет Debian ]

# unit1.sdebian2
source: For converting to (but not from) deb format, the gcc, make, debmake, dpkg-dev, and dpkg packages must be installed.
ru: Для преобразования в формат deb (но не из него) необходимо установить пакеты gcc, make, debmake, dpkg-dev и dpkg.

# unit1.sfinal
source: [ Select your final package type ]
ru: [ Выберите тип конечного пакета ]

# unit1.sfinal2
source: alien supports conversion between Linux Standard Base (LSB), LSB-compliant .rpm packages, .deb, Stampede (.slp), Solaris (.pkg) and Slackware (.tgz, .txz, .tbz, .tlz) packages. It is also capable of automatically installing the generated packages, and can try to convert the installation scripts included in the archive well.
ru: alien поддерживает преобразование между пакетами Linux Standard Base (LSB), LSB-совместимыми пакетами .rpm, .deb, Stampede (.slp), Solaris (.pkg) и Slackware (.tgz, .txz, .tbz, .tlz). Он также способен автоматически устанавливать сгенерированные пакеты и может попытаться преобразовать сценарии установки, включенные в архив.

source: [ Generate a LSB package ]
ru: [ Создать пакет LSB ]

# unit1.slsb2
source: Unlike the other package formats, alien can handle the depenendencies of lsb packages if the destination package format supports dependencies. Note that this means that the package generated from a lsb package will depend on a package named "lsb" -- your distribution should provide a package by that name, if it is lsb compliant. The scripts in the lsb package will be converted by default as well.
ru: В отличие от других форматов пакетов, alien может обрабатывать зависимости пакетов lsb, если формат целевого пакета поддерживает зависимости. Обратите внимание, что это означает, что пакет, сгенерированный из пакета lsb, будет зависеть от пакета с именем "lsb" - ваш дистрибутив должен предоставить пакет с таким именем, если он совместим с lsb. Скрипты в пакете lsb также будут преобразованы по умолчанию.

source: Conversion...
ru: Конвертирование...

# unit1.sprogressidle
source: Idle
ru: Ожидание

source: [ Generate a Red Hat package ]
ru: [ Создать пакет Red Hat ]

# unit1.sredhat2
source: For converting to and from rpm format the Red Hat Package Manager must be installed.
ru: Для преобразования в формат rpm и обратно должен быть установлен менеджер пакетов Red Hat.

source: [ Generate a SlackWare tgz package ]
ru: [ Создать пакет SlackWare tgz ]

# unit1.sslackware2
source: Note that when converting from the tgz format, alien will simply generate an output package that has the same files in it as are in the tgz file. This only works well if the tgz file has precompiled binaries in it in a standard linux directory tree. Do NOT run alien on tar files with source code in them, unless you want this source code to be installed in your root directory when you install the package!
ru: Обратите внимание, что при преобразовании из формата tgz alien просто сгенерирует выходной пакет, содержащий те же файлы, что и в файле tgz. Это хорошо работает только в том случае, если файл tgz содержит предварительно скомпилированные двоичные файлы в стандартном дереве каталогов linux. Не запускайте tar файлы с исходным кодом в них, если вы не хотите, чтобы этот исходный код был установлен в вашем корневом каталоге при установке пакета!

source: [ Generate a Solaris pkg package ]
ru: [ Создать пакет Solaris pkg ]

# unit1.ssolaris2
source: To manipulate packages in the Solaris pkg format (which is really the SV datastream package format, you will need the Solaris pkginfo and pkgtrans tools.
ru: Для работы с пакетами в формате Solaris pkg (который на самом деле является форматом пакета SV data stream) вам понадобятся инструменты Solaris pkginfo и pkgtrans.

source: [ Generate a Stampede slp package ]
ru: [ Создать пакет Stampede slp ]

# unit1.sstampede2
source: Make slp package
ru: Сделать slp пакет

source: 1. Select the package to convert 2. Select the directory for the final package 3. Select your final package type
ru: 1. Выберите пакет для конвертирования 2. Выберите каталог для конечного пакета 3. Выберите тип для конечного пакета
